Ran Plan for 2 projects:

1. project: `gateway-cloudfront-prod` dir: `terraform/environments/prod/cloudfront` workspace: `default`
1. project: `gateway-cloudfront-stage` dir: `terraform/environments/stage/cloudfront` workspace: `default`
---

### 1. project: `gateway-cloudfront-prod` dir: `terraform/environments/prod/cloudfront` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.prod will be updated in-place
~ resource "aws_cloudfront_distribution" "prod" {
      ~ aliases                         = [
          + "set-of.com",
            # (1 unchanged element hidden)
        ]
        id                              = "E1DWFQ3MCX4AB8"
        tags                            = {
            "Name"         = "gateway-cloudfront-prod"
            "cost_center"  = "engineering"
            "environment"  = "prod"
            "owner"        = "platform@ryuqqq.com"
            "project"      = "gateway"
            "service_name" = "gateway"
            "team"         = "platform-team"
        }
        # (22 unchanged attributes hidden)

        # (11 unchanged blocks hidden)
    }

  # aws_route53_record.prod_apex will be updated in-place
~ resource "aws_route53_record" "prod_apex" {
        id                               = "Z104656329CL6XBYE8OIJ_set-of.com_A"
        name                             = "set-of.com"
        # (8 unchanged attributes hidden)

      ~ alias {
          ~ name                   = "d1qw60eo1qsssn.cloudfront.net" -> "dqoq52g7o344t.cloudfront.net"
            # (2 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gateway-cloudfront-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FGateway%252Fterraform%252Fenvironments%252Fprod%252Fcloudfront%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gateway-cloudfront-prod
  ```
Plan: 0 to add, 2 to change, 0 to destroy.

---
### 2. project: `gateway-cloudfront-stage` dir: `terraform/environments/stage/cloudfront` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.admin_stage will be updated in-place
~ resource "aws_cloudfront_distribution" "admin_stage" {
        id                              = "E1DT88HGE47MQT"
        tags                            = {
            "Name"         = "gateway-cloudfront-admin-stage"
            "cost_center"  = "engineering"
            "environment"  = "stage"
            "owner"        = "platform@ryuqqq.com"
            "project"      = "gateway"
            "service_name" = "gateway"
            "team"         = "platform-team"
        }
      + web_acl_id                      = (known after apply)
        # (22 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ response_headers_policy_id = "7e7f75ab-054b-430f-b525-9d7637e39b17" -> "4b5bc3bb-9d4c-4cd0-8ce4-42e55964be1e"
            # (15 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_wafv2_web_acl.admin_stage will be created
+ resource "aws_wafv2_web_acl" "admin_stage" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "WAF WebACL for Stage Admin CloudFront"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "gateway-admin-waf-stage"
      + name_prefix                 = (known after apply)
      + scope                       = "CLOUDFRONT"
      + tags                        = {
          + "Name"         = "gateway-admin-waf-stage"
          + "cost_center"  = "engineering"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "gateway"
          + "service_name" = "gateway"
          + "team"         = "platform-team"
        }
      + tags_all                    = {
          + "Name"         = "gateway-admin-waf-stage"
          + "cost_center"  = "engineering"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "gateway"
          + "service_name" = "gateway"
          + "team"         = "platform-team"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "RateLimitRule"
          + priority = 3

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 2000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "gateway-admin-rate-limit"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 1

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "gateway-admin-common-rules"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 2

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "gateway-admin-bad-inputs"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "gateway-admin-waf"
          + sampled_requests_enabled   = true
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gateway-cloudfront-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FGateway%252Fterraform%252Fenvironments%252Fstage%252Fcloudfront%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gateway-cloudfront-stage
  ```
Plan: 1 to add, 1 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```